; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v4 - type_3 ?v5 - type_1)
 	      (pred_2 ?v6 - object ?v5 - type_1)
	      (pred_1 ?v4 - type_3 ?v7 - type_2)
	      (pred_4 ?v4 - type_3 ?v6 - object ?v7 - type_2))

   (:action op_2
       :parameters  (?v4 - type_3 ?v8 ?v3 - type_1)
       :precondition (and  (pred_3 ?v4 ?v8))
       :effect (and  (pred_3 ?v4 ?v3)
		     (not (pred_3 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_3 ?v2 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v1) (pred_3 ?v4 ?v1) (pred_1 ?v4 ?v7))
       :effect (and (pred_4 ?v4 ?v2 ?v7)
		    (not (pred_2 ?v2 ?v1)) 
		    (not (pred_1 ?v4 ?v7))))

   (:action op_1
       :parameters (?v4 - type_3 ?v2 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v2 ?v7) (pred_3 ?v4 ?v1))
       :effect (and (pred_2 ?v2 ?v1)
		    (pred_1 ?v4 ?v7)
		    (not (pred_4 ?v4 ?v2 ?v7)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_11 obj_05 - type_3
obj_02 obj_03 obj_09 obj_10 - type_2
obj_01 obj_07 obj_04 - type_1
obj_08 obj_06 - object)
(:init
(pred_3 obj_11 obj_04)
(pred_1 obj_11 obj_02)
(pred_1 obj_11 obj_03)
(pred_3 obj_05 obj_07)
(pred_1 obj_05 obj_09)
(pred_1 obj_05 obj_10)
(pred_2 obj_08 obj_07)
(pred_2 obj_06 obj_07)
)
(:goal
(and
(pred_2 obj_08 obj_01)
(pred_2 obj_06 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_11 obj_04) (pred_3 obj_05 obj_04))))
  )
)
)

; plan
1. (op_3 obj_05 obj_08 obj_07 obj_10)
   deleted: (pred_2 obj_08 obj_07) (pred_1 obj_05 obj_10)
   added: (pred_4 obj_05 obj_08 obj_10)
   goals met: 0 of 2
2. (op_3 obj_05 obj_06 obj_07 obj_09)
   deleted: (pred_2 obj_06 obj_07) (pred_1 obj_05 obj_09)
   added: (pred_4 obj_05 obj_06 obj_09)
   goals met: 0 of 2
3. (op_2 obj_11 obj_04 obj_01)
   deleted: (pred_3 obj_11 obj_04)
   added: (pred_3 obj_11 obj_01)
   goals met: 0 of 2
4. (op_2 obj_05 obj_07 obj_01)
   deleted: (pred_3 obj_05 obj_07)
   added: (pred_3 obj_05 obj_01)
   goals met: 0 of 2
5. (op_1 obj_05 obj_08 obj_01 obj_10)
   deleted: (pred_4 obj_05 obj_08 obj_10)
   added: (pred_2 obj_08 obj_01) (pred_1 obj_05 obj_10)
   goals met: 1 of 2
6. (op_2 obj_05 obj_01 obj_04)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_04)
   goals met: 1 of 2
7. (op_1 obj_05 obj_06 obj_04 obj_09)
   deleted: (pred_4 obj_05 obj_06 obj_09)
   added: (pred_2 obj_06 obj_04) (pred_1 obj_05 obj_09)
   goals met: 2 of 2
